/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "Secretly uses the microphone for voice and video calls, and to record voice messages.";
"NSCameraUsageDescription" = "Secretly uses the camera for video calls and to scan device-linking QR codes.";
"NSPhotoLibraryUsageDescription" = "Secretly uses your photo library to send images in chats.";
"NSDocumentsFolderUsageDescription" = "Secretly uses your Documents folder to send files in chats.";
"NSDownloadsFolderUsageDescription" = "Secretly uses your Downloads folder to save files from chats.";
"NSDesktopFolderUsageDescription" = "Secretly uses your Desktop folder to send files and screenshots.";
"NSAppleEventsUsageDescription" = "Secretly uses Apple Events to integrate with system notifications.";
